summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN28 */
#define IFX_VADC_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN29 */
#define IFX_VADC_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN2 */
#define IFX_VADC_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN30 */
#define IFX_VADC_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN31 */
#define IFX_VADC_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN3 */
#define IFX_VADC_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN4 */
#define IFX_VADC_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN5 */
#define IFX_VADC_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN6 */
#define IFX_VADC_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN7 */
#define IFX_VADC_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN8 */
#define IFX_VADC_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCEN0_Bits.EN9 */
#define IFX_VADC_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC0 */
#define IFX_VADC_ACCPROT0_APC0_OFF (0)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC10 */
#define IFX_VADC_ACCPROT0_APC10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC10 */
#define IFX_VADC_ACCPROT0_APC10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC10 */
#define IFX_VADC_ACCPROT0_APC10_OFF (10)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC11 */
#define IFX_VADC_ACCPROT0_APC11_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC11 */
#define IFX_VADC_ACCPROT0_APC11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC11 */
#define IFX_VADC_ACCPROT0_APC11_OFF (11)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC12 */
#define IFX_VADC_ACCPROT0_APC12_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC12 */
#define IFX_VADC_ACCPROT0_APC12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC12 */
#define IFX_VADC_ACCPROT0_APC12_OFF (12)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC13 */
#define IFX_VADC_ACCPROT0_APC13_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC13 */
#define IFX_VADC_ACCPROT0_APC13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC13 */
#define IFX_VADC_ACCPROT0_APC13_OFF (13)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC14 */
#define IFX_VADC_ACCPROT0_APC14_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC14 */
#define IFX_VADC_ACCPROT0_APC14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC14 */
#define IFX_VADC_ACCPROT0_APC14_OFF (14)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC1 */
#define IFX_VADC_ACCPROT0_APC1_OFF (1)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC2 */
#define IFX_VADC_ACCPROT0_APC2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC3 */
#define IFX_VADC_ACCPROT0_APC3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.APC4 */
#define IFX_VADC_ACCPROT0_APC4_OFF (4)

