summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API9 */
#define IFX_VADC_ACCPROT0_API9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API9 */
#define IFX_VADC_ACCPROT0_API9_OFF (25)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_OFF (16)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR10 */
#define IFX_VADC_ACCPROT1_APR10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR10 */
#define IFX_VADC_ACCPROT1_APR10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR10 */
#define IFX_VADC_ACCPROT1_APR10_OFF (26)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR11 */
#define IFX_VADC_ACCPROT1_APR11_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR11 */
#define IFX_VADC_ACCPROT1_APR11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR11 */
#define IFX_VADC_ACCPROT1_APR11_OFF (27)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR12 */
#define IFX_VADC_ACCPROT1_APR12_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR12 */
#define IFX_VADC_ACCPROT1_APR12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR12 */
#define IFX_VADC_ACCPROT1_APR12_OFF (28)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR13 */
#define IFX_VADC_ACCPROT1_APR13_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR13 */
#define IFX_VADC_ACCPROT1_APR13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR13 */
#define IFX_VADC_ACCPROT1_APR13_OFF (29)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR14 */
#define IFX_VADC_ACCPROT1_APR14_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR14 */
#define IFX_VADC_ACCPROT1_APR14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR14 */
#define IFX_VADC_ACCPROT1_APR14_OFF (30)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_OFF (17)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_OFF (18)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_OFF (19)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_OFF (20)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_OFF (21)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_OFF (22)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_OFF (23)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR8 */
#define IFX_VADC_ACCPROT1_APR8_OFF (24)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR9 */
#define IFX_VADC_ACCPROT1_APR9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR9 */
#define IFX_VADC_ACCPROT1_APR9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR9 */
#define IFX_VADC_ACCPROT1_APR9_OFF (25)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_OFF (0)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS10 */
#define IFX_VADC_ACCPROT1_APS10_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS10 */
#define IFX_VADC_ACCPROT1_APS10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS10 */
#define IFX_VADC_ACCPROT1_APS10_OFF (10)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS11 */
#define IFX_VADC_ACCPROT1_APS11_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS11 */
#define IFX_VADC_ACCPROT1_APS11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS11 */
#define IFX_VADC_ACCPROT1_APS11_OFF (11)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS12 */
#define IFX_VADC_ACCPROT1_APS12_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS12 */
#define IFX_VADC_ACCPROT1_APS12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS12 */
#define IFX_VADC_ACCPROT1_APS12_OFF (12)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS13 */
#define IFX_VADC_ACCPROT1_APS13_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS13 */
#define IFX_VADC_ACCPROT1_APS13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS13 */
#define IFX_VADC_ACCPROT1_APS13_OFF (13)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS14 */
#define IFX_VADC_ACCPROT1_APS14_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS14 */
#define IFX_VADC_ACCPROT1_APS14_MSK (0x1)

