summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS14 */
#define IFX_VADC_ACCPROT1_APS14_OFF (14)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_OFF (1)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_OFF (4)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_OFF (5)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_OFF (6)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_OFF (7)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS8 */
#define IFX_VADC_ACCPROT1_APS8_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS8 */
#define IFX_VADC_ACCPROT1_APS8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS8 */
#define IFX_VADC_ACCPROT1_APS8_OFF (8)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS9 */
#define IFX_VADC_ACCPROT1_APS9_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS9 */
#define IFX_VADC_ACCPROT1_APS9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS9 */
#define IFX_VADC_ACCPROT1_APS9_OFF (9)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_OFF (15)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_OFF (16)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_OFF (23)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_OFF (12)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_OFF (13)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_OFF (8)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_OFF (15)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_OFF (8)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_LEN (2)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_OFF (3)

