summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV11 */
#define IFX_VADC_G_CEFLAG_CEV11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV12 */
#define IFX_VADC_G_CEFLAG_CEV12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV12 */
#define IFX_VADC_G_CEFLAG_CEV12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV12 */
#define IFX_VADC_G_CEFLAG_CEV12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV13 */
#define IFX_VADC_G_CEFLAG_CEV13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV13 */
#define IFX_VADC_G_CEFLAG_CEV13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV13 */
#define IFX_VADC_G_CEFLAG_CEV13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV14 */
#define IFX_VADC_G_CEFLAG_CEV14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV14 */
#define IFX_VADC_G_CEFLAG_CEV14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV14 */
#define IFX_VADC_G_CEFLAG_CEV14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV15 */
#define IFX_VADC_G_CEFLAG_CEV15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV15 */
#define IFX_VADC_G_CEFLAG_CEV15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV15 */
#define IFX_VADC_G_CEFLAG_CEV15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV1 */
#define IFX_VADC_G_CEFLAG_CEV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV1 */
#define IFX_VADC_G_CEFLAG_CEV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV1 */
#define IFX_VADC_G_CEFLAG_CEV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV2 */
#define IFX_VADC_G_CEFLAG_CEV2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV2 */
#define IFX_VADC_G_CEFLAG_CEV2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV2 */
#define IFX_VADC_G_CEFLAG_CEV2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV3 */
#define IFX_VADC_G_CEFLAG_CEV3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV3 */
#define IFX_VADC_G_CEFLAG_CEV3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV3 */
#define IFX_VADC_G_CEFLAG_CEV3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV4 */
#define IFX_VADC_G_CEFLAG_CEV4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV4 */
#define IFX_VADC_G_CEFLAG_CEV4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV4 */
#define IFX_VADC_G_CEFLAG_CEV4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV5 */
#define IFX_VADC_G_CEFLAG_CEV5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV5 */
#define IFX_VADC_G_CEFLAG_CEV5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV5 */
#define IFX_VADC_G_CEFLAG_CEV5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV6 */
#define IFX_VADC_G_CEFLAG_CEV6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV6 */
#define IFX_VADC_G_CEFLAG_CEV6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV6 */
#define IFX_VADC_G_CEFLAG_CEV6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV7 */
#define IFX_VADC_G_CEFLAG_CEV7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV7 */
#define IFX_VADC_G_CEFLAG_CEV7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV7 */
#define IFX_VADC_G_CEFLAG_CEV7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV8 */
#define IFX_VADC_G_CEFLAG_CEV8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV8 */
#define IFX_VADC_G_CEFLAG_CEV8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV8 */
#define IFX_VADC_G_CEFLAG_CEV8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_CEFLAG_Bits.CEV9 */
#define IFX_VADC_G_CEFLAG_CEV9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CEFLAG_Bits.CEV9 */
#define IFX_VADC_G_CEFLAG_CEV9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CEFLAG_Bits.CEV9 */
#define IFX_VADC_G_CEFLAG_CEV9_OFF (9)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_VADC_G_CEVNP0_CEV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_VADC_G_CEVNP0_CEV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_VADC_G_CEVNP0_CEV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_VADC_G_CEVNP0_CEV1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_VADC_G_CEVNP0_CEV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_VADC_G_CEVNP0_CEV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_VADC_G_CEVNP0_CEV2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_VADC_G_CEVNP0_CEV2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_VADC_G_CEVNP0_CEV2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_VADC_G_CEVNP0_CEV3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_VADC_G_CEVNP0_CEV3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_VADC_G_CEVNP0_CEV3NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_VADC_G_CEVNP0_CEV4NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_VADC_G_CEVNP0_CEV4NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_VADC_G_CEVNP0_CEV4NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_VADC_G_CEVNP0_CEV5NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_VADC_G_CEVNP0_CEV5NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_VADC_G_CEVNP0_CEV5NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_VADC_G_CEVNP0_CEV6NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_VADC_G_CEVNP0_CEV6NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_VADC_G_CEVNP0_CEV6NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_VADC_G_CEVNP0_CEV7NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_VADC_G_CEVNP0_CEV7NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_VADC_G_CEVNP0_CEV7NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV10NP */
#define IFX_VADC_G_CEVNP1_CEV10NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV10NP */
#define IFX_VADC_G_CEVNP1_CEV10NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV10NP */
#define IFX_VADC_G_CEVNP1_CEV10NP_OFF (8)

