summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV11NP */
#define IFX_VADC_G_CEVNP1_CEV11NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV11NP */
#define IFX_VADC_G_CEVNP1_CEV11NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV11NP */
#define IFX_VADC_G_CEVNP1_CEV11NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV12NP */
#define IFX_VADC_G_CEVNP1_CEV12NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV12NP */
#define IFX_VADC_G_CEVNP1_CEV12NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV12NP */
#define IFX_VADC_G_CEVNP1_CEV12NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV13NP */
#define IFX_VADC_G_CEVNP1_CEV13NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV13NP */
#define IFX_VADC_G_CEVNP1_CEV13NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV13NP */
#define IFX_VADC_G_CEVNP1_CEV13NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV14NP */
#define IFX_VADC_G_CEVNP1_CEV14NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV14NP */
#define IFX_VADC_G_CEVNP1_CEV14NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV14NP */
#define IFX_VADC_G_CEVNP1_CEV14NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV15NP */
#define IFX_VADC_G_CEVNP1_CEV15NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV15NP */
#define IFX_VADC_G_CEVNP1_CEV15NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV15NP */
#define IFX_VADC_G_CEVNP1_CEV15NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV8NP */
#define IFX_VADC_G_CEVNP1_CEV8NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV8NP */
#define IFX_VADC_G_CEVNP1_CEV8NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV8NP */
#define IFX_VADC_G_CEVNP1_CEV8NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CEVNP1_Bits.CEV9NP */
#define IFX_VADC_G_CEVNP1_CEV9NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_CEVNP1_Bits.CEV9NP */
#define IFX_VADC_G_CEVNP1_CEV9NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_CEVNP1_Bits.CEV9NP */
#define IFX_VADC_G_CEVNP1_CEV9NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH0 */
#define IFX_VADC_G_CHASS_ASSCH0_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH0 */
#define IFX_VADC_G_CHASS_ASSCH0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH0 */
#define IFX_VADC_G_CHASS_ASSCH0_OFF (0)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH10 */
#define IFX_VADC_G_CHASS_ASSCH10_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH10 */
#define IFX_VADC_G_CHASS_ASSCH10_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH10 */
#define IFX_VADC_G_CHASS_ASSCH10_OFF (10)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH11 */
#define IFX_VADC_G_CHASS_ASSCH11_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH11 */
#define IFX_VADC_G_CHASS_ASSCH11_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH11 */
#define IFX_VADC_G_CHASS_ASSCH11_OFF (11)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH12 */
#define IFX_VADC_G_CHASS_ASSCH12_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH12 */
#define IFX_VADC_G_CHASS_ASSCH12_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH12 */
#define IFX_VADC_G_CHASS_ASSCH12_OFF (12)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH13 */
#define IFX_VADC_G_CHASS_ASSCH13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH13 */
#define IFX_VADC_G_CHASS_ASSCH13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH13 */
#define IFX_VADC_G_CHASS_ASSCH13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH14 */
#define IFX_VADC_G_CHASS_ASSCH14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH14 */
#define IFX_VADC_G_CHASS_ASSCH14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH14 */
#define IFX_VADC_G_CHASS_ASSCH14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH15 */
#define IFX_VADC_G_CHASS_ASSCH15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH15 */
#define IFX_VADC_G_CHASS_ASSCH15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH15 */
#define IFX_VADC_G_CHASS_ASSCH15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH16 */
#define IFX_VADC_G_CHASS_ASSCH16_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH16 */
#define IFX_VADC_G_CHASS_ASSCH16_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH16 */
#define IFX_VADC_G_CHASS_ASSCH16_OFF (16)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH17 */
#define IFX_VADC_G_CHASS_ASSCH17_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH17 */
#define IFX_VADC_G_CHASS_ASSCH17_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH17 */
#define IFX_VADC_G_CHASS_ASSCH17_OFF (17)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH18 */
#define IFX_VADC_G_CHASS_ASSCH18_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH18 */
#define IFX_VADC_G_CHASS_ASSCH18_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH18 */
#define IFX_VADC_G_CHASS_ASSCH18_OFF (18)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH19 */
#define IFX_VADC_G_CHASS_ASSCH19_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH19 */
#define IFX_VADC_G_CHASS_ASSCH19_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH19 */
#define IFX_VADC_G_CHASS_ASSCH19_OFF (19)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH1 */
#define IFX_VADC_G_CHASS_ASSCH1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH1 */
#define IFX_VADC_G_CHASS_ASSCH1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH1 */
#define IFX_VADC_G_CHASS_ASSCH1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH20 */
#define IFX_VADC_G_CHASS_ASSCH20_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_CHASS_Bits.ASSCH20 */
#define IFX_VADC_G_CHASS_ASSCH20_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_CHASS_Bits.ASSCH20 */
#define IFX_VADC_G_CHASS_ASSCH20_OFF (20)

/** \\brief  Length for Ifx_VADC_G_CHASS_Bits.ASSCH21 */
#define IFX_VADC_G_CHASS_ASSCH21_LEN (1)

