summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXMODE */
#define IFX_VADC_G_EMUXCTR_EMUXMODE_OFF (26)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_LEN (3)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMUXSET */
#define IFX_VADC_G_EMUXCTR_EMUXSET_OFF (0)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCOD */
#define IFX_VADC_G_EMUXCTR_EMXCOD_OFF (28)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXCSS */
#define IFX_VADC_G_EMUXCTR_EMXCSS_OFF (30)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXST */
#define IFX_VADC_G_EMUXCTR_EMXST_OFF (29)

/** \\brief  Length for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_EMUXCTR_Bits.EMXWC */
#define IFX_VADC_G_EMUXCTR_EMXWC_OFF (31)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.ENSI */
#define IFX_VADC_G_Q0R0_ENSI_OFF (6)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.EXTR */
#define IFX_VADC_G_Q0R0_EXTR_OFF (7)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.REQCHNR */
#define IFX_VADC_G_Q0R0_REQCHNR_OFF (0)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.RF */
#define IFX_VADC_G_Q0R0_RF_OFF (5)

/** \\brief  Length for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_Q0R0_Bits.V */
#define IFX_VADC_G_Q0R0_V_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_ENSI_OFF (6)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_EXTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_EXTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_EXTR_OFF (7)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_REQCHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_REQCHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_REQCHNR_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_RF_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_RF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_RF_OFF (5)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_V_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_V_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QBUR0_Bits.V */
#define IFX_VADC_G_QBUR_QINR0_QBUR0_V_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QINR0_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QINR0_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.ENSI */
#define IFX_VADC_G_QBUR_QINR0_QINR0_ENSI_OFF (6)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_EXTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_EXTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.EXTR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_EXTR_OFF (7)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_REQCHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_REQCHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.REQCHNR */
#define IFX_VADC_G_QBUR_QINR0_QINR0_REQCHNR_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QINR0_RF_LEN (1)

