summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QINR0_RF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QBUR_QINR0_QINR0_Bits.RF */
#define IFX_VADC_G_QBUR_QINR0_QINR0_RF_OFF (5)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTLVL */
#define IFX_VADC_G_QCTRL0_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTSEL */
#define IFX_VADC_G_QCTRL0_GTSEL_OFF (16)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.GTWC */
#define IFX_VADC_G_QCTRL0_GTWC_OFF (23)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.SRCRESREG */
#define IFX_VADC_G_QCTRL0_SRCRESREG_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMEN */
#define IFX_VADC_G_QCTRL0_TMEN_OFF (28)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.TMWC */
#define IFX_VADC_G_QCTRL0_TMWC_OFF (31)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTLVL */
#define IFX_VADC_G_QCTRL0_XTLVL_OFF (12)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTMODE */
#define IFX_VADC_G_QCTRL0_XTMODE_OFF (13)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTSEL */
#define IFX_VADC_G_QCTRL0_XTSEL_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QCTRL0_Bits.XTWC */
#define IFX_VADC_G_QCTRL0_XTWC_OFF (15)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.CEV */
#define IFX_VADC_G_QMR0_CEV_OFF (11)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.CLRV */
#define IFX_VADC_G_QMR0_CLRV_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_LEN (2)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.ENGT */
#define IFX_VADC_G_QMR0_ENGT_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.ENTR */
#define IFX_VADC_G_QMR0_ENTR_OFF (2)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.FLUSH */
#define IFX_VADC_G_QMR0_FLUSH_OFF (10)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.RPTDIS */
#define IFX_VADC_G_QMR0_RPTDIS_OFF (16)

/** \\brief  Length for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QMR0_Bits.TREV */
#define IFX_VADC_G_QMR0_TREV_OFF (9)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.EMPTY */
#define IFX_VADC_G_QSR0_EMPTY_OFF (5)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.EV */
#define IFX_VADC_G_QSR0_EV_OFF (8)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.FILL */
#define IFX_VADC_G_QSR0_FILL_OFF (0)

/** \\brief  Length for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_QSR0_Bits.REQGT */
#define IFX_VADC_G_QSR0_REQGT_OFF (7)

