summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV14 */
#define IFX_VADC_G_REFLAG_REV14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV15 */
#define IFX_VADC_G_REFLAG_REV15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV15 */
#define IFX_VADC_G_REFLAG_REV15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV15 */
#define IFX_VADC_G_REFLAG_REV15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV1 */
#define IFX_VADC_G_REFLAG_REV1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV1 */
#define IFX_VADC_G_REFLAG_REV1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV1 */
#define IFX_VADC_G_REFLAG_REV1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV2 */
#define IFX_VADC_G_REFLAG_REV2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV2 */
#define IFX_VADC_G_REFLAG_REV2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV2 */
#define IFX_VADC_G_REFLAG_REV2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV3 */
#define IFX_VADC_G_REFLAG_REV3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV4 */
#define IFX_VADC_G_REFLAG_REV4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV5 */
#define IFX_VADC_G_REFLAG_REV5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV6 */
#define IFX_VADC_G_REFLAG_REV6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV7 */
#define IFX_VADC_G_REFLAG_REV7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV8 */
#define IFX_VADC_G_REFLAG_REV8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_REFLAG_Bits.REV9 */
#define IFX_VADC_G_REFLAG_REV9_OFF (9)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV0NP */
#define IFX_VADC_G_REVNP0_REV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV1NP */
#define IFX_VADC_G_REVNP0_REV1NP_OFF (4)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV2NP */
#define IFX_VADC_G_REVNP0_REV2NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV3NP */
#define IFX_VADC_G_REVNP0_REV3NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV4NP */
#define IFX_VADC_G_REVNP0_REV4NP_OFF (16)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV5NP */
#define IFX_VADC_G_REVNP0_REV5NP_OFF (20)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV6NP */
#define IFX_VADC_G_REVNP0_REV6NP_OFF (24)

/** \\brief  Length for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP0_Bits.REV7NP */
#define IFX_VADC_G_REVNP0_REV7NP_OFF (28)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV10NP */
#define IFX_VADC_G_REVNP1_REV10NP_OFF (8)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV11NP */
#define IFX_VADC_G_REVNP1_REV11NP_OFF (12)

/** \\brief  Length for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_G_REVNP1_Bits.REV12NP */
#define IFX_VADC_G_REVNP1_REV12NP_OFF (16)

