summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF13 */
#define IFX_VADC_G_VFR_VF13_OFF (13)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF14 */
#define IFX_VADC_G_VFR_VF14_OFF (14)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF15 */
#define IFX_VADC_G_VFR_VF15_OFF (15)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF1 */
#define IFX_VADC_G_VFR_VF1_OFF (1)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF2 */
#define IFX_VADC_G_VFR_VF2_OFF (2)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF3 */
#define IFX_VADC_G_VFR_VF3_OFF (3)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF4 */
#define IFX_VADC_G_VFR_VF4_OFF (4)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF5 */
#define IFX_VADC_G_VFR_VF5_OFF (5)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF6 */
#define IFX_VADC_G_VFR_VF6_OFF (6)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF7 */
#define IFX_VADC_G_VFR_VF7_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF7 */
#define IFX_VADC_G_VFR_VF7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF7 */
#define IFX_VADC_G_VFR_VF7_OFF (7)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF8 */
#define IFX_VADC_G_VFR_VF8_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF8 */
#define IFX_VADC_G_VFR_VF8_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF8 */
#define IFX_VADC_G_VFR_VF8_OFF (8)

/** \\brief  Length for Ifx_VADC_G_VFR_Bits.VF9 */
#define IFX_VADC_G_VFR_VF9_LEN (1)

/** \\brief  Mask for Ifx_VADC_G_VFR_Bits.VF9 */
#define IFX_VADC_G_VFR_VF9_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_G_VFR_Bits.VF9 */
#define IFX_VADC_G_VFR_VF9_OFF (9)

/** \\brief  Length for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY0 */
#define IFX_VADC_GLOBBOUND_BOUNDARY0_LEN (12)

/** \\brief  Mask for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY0 */
#define IFX_VADC_GLOBBOUND_BOUNDARY0_MSK (0xfff)

/** \\brief  Offset for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY0 */
#define IFX_VADC_GLOBBOUND_BOUNDARY0_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY1 */
#define IFX_VADC_GLOBBOUND_BOUNDARY1_LEN (12)

/** \\brief  Mask for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY1 */
#define IFX_VADC_GLOBBOUND_BOUNDARY1_MSK (0xfff)

/** \\brief  Offset for Ifx_VADC_GLOBBOUND_Bits.BOUNDARY1 */
#define IFX_VADC_GLOBBOUND_BOUNDARY1_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DCMSB */
#define IFX_VADC_GLOBCFG_DCMSB_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DCMSB */
#define IFX_VADC_GLOBCFG_DCMSB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DCMSB */
#define IFX_VADC_GLOBCFG_DCMSB_OFF (7)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DIVA */
#define IFX_VADC_GLOBCFG_DIVA_LEN (5)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DIVA */
#define IFX_VADC_GLOBCFG_DIVA_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DIVA */
#define IFX_VADC_GLOBCFG_DIVA_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DIVD */
#define IFX_VADC_GLOBCFG_DIVD_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DIVD */
#define IFX_VADC_GLOBCFG_DIVD_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DIVD */
#define IFX_VADC_GLOBCFG_DIVD_OFF (8)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DIVWC */
#define IFX_VADC_GLOBCFG_DIVWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DIVWC */
#define IFX_VADC_GLOBCFG_DIVWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DIVWC */
#define IFX_VADC_GLOBCFG_DIVWC_OFF (15)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL0 */
#define IFX_VADC_GLOBCFG_DPCAL0_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL0 */
#define IFX_VADC_GLOBCFG_DPCAL0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL0 */
#define IFX_VADC_GLOBCFG_DPCAL0_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL1 */
#define IFX_VADC_GLOBCFG_DPCAL1_OFF (17)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.DPCAL2 */
#define IFX_VADC_GLOBCFG_DPCAL2_OFF (18)

/** \\brief  Length for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBCFG_Bits.SUCAL */
#define IFX_VADC_GLOBCFG_SUCAL_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.REVGLB */
#define IFX_VADC_GLOBEFLAG_REVGLB_OFF (8)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.REVGLBCLR */
#define IFX_VADC_GLOBEFLAG_REVGLBCLR_OFF (24)

/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.SEVGLB */
#define IFX_VADC_GLOBEFLAG_SEVGLB_OFF (0)

