summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBEFLAG_Bits.SEVGLBCLR */
#define IFX_VADC_GLOBEFLAG_SEVGLBCLR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBEVNP_Bits.REV0NP */
#define IFX_VADC_GLOBEVNP_REV0NP_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBEVNP_Bits.SEV0NP */
#define IFX_VADC_GLOBEVNP_SEV0NP_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBRCR_Bits.DRCTR */
#define IFX_VADC_GLOBRCR_DRCTR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRCR_Bits.SRGEN */
#define IFX_VADC_GLOBRCR_SRGEN_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRCR_Bits.WFR */
#define IFX_VADC_GLOBRCR_WFR_OFF (24)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.CHNR */
#define IFX_VADC_GLOBRES_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.CRS */
#define IFX_VADC_GLOBRES_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.EMUX */
#define IFX_VADC_GLOBRES_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.FCR */
#define IFX_VADC_GLOBRES_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.GNR */
#define IFX_VADC_GLOBRES_GNR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.RESULT */
#define IFX_VADC_GLOBRES_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRES_Bits.VF */
#define IFX_VADC_GLOBRES_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.CHNR */
#define IFX_VADC_GLOBRESD_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.CRS */
#define IFX_VADC_GLOBRESD_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.EMUX */
#define IFX_VADC_GLOBRESD_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.FCR */
#define IFX_VADC_GLOBRESD_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.GNR */
#define IFX_VADC_GLOBRESD_GNR_OFF (16)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.RESULT */
#define IFX_VADC_GLOBRESD_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBRESD_Bits.VF */
#define IFX_VADC_GLOBRESD_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDCH */
#define IFX_VADC_GLOBTF_CDCH_OFF (0)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDEN */
#define IFX_VADC_GLOBTF_CDEN_OFF (8)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_LEN (4)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDGR */
#define IFX_VADC_GLOBTF_CDGR_OFF (4)

