summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_LEN (2)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDSEL */
#define IFX_VADC_GLOBTF_CDSEL_OFF (9)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.CDWC */
#define IFX_VADC_GLOBTF_CDWC_OFF (15)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.MDPD */
#define IFX_VADC_GLOBTF_MDPD_OFF (17)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.MDPU */
#define IFX_VADC_GLOBTF_MDPU_OFF (18)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.MDWC */
#define IFX_VADC_GLOBTF_MDWC_OFF (23)

/** \\brief  Length for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_LEN (1)

/** \\brief  Mask for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_GLOBTF_Bits.PDD */
#define IFX_VADC_GLOBTF_PDD_OFF (16)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_LEN (3)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.CME */
#define IFX_VADC_ICLASS_CME_OFF (24)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_LEN (3)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.CMS */
#define IFX_VADC_ICLASS_CMS_OFF (8)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_LEN (5)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.STCE */
#define IFX_VADC_ICLASS_STCE_OFF (16)

/** \\brief  Length for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_LEN (5)

/** \\brief  Mask for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_ICLASS_Bits.STCS */
#define IFX_VADC_ICLASS_STCS_OFF (0)

/** \\brief  Length for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_ID_Bits.MODNUMBER */
#define IFX_VADC_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_VADC_ID_Bits.MODREV */
#define IFX_VADC_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_VADC_ID_Bits.MODREV */
#define IFX_VADC_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_ID_Bits.MODREV */
#define IFX_VADC_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_VADC_ID_Bits.MODTYPE */
#define IFX_VADC_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_VADC_ID_Bits.MODTYPE */
#define IFX_VADC_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_ID_Bits.MODTYPE */
#define IFX_VADC_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRST0_Bits.RST */
#define IFX_VADC_KRST0_RST_OFF (0)

/** \\brief  Length for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRST0_Bits.RSTSTAT */
#define IFX_VADC_KRST0_RSTSTAT_OFF (1)

/** \\brief  Length for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRST1_Bits.RST */
#define IFX_VADC_KRST1_RST_OFF (0)

/** \\brief  Length for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_LEN (1)

/** \\brief  Mask for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_KRSTCLR_Bits.CLR */
#define IFX_VADC_KRSTCLR_CLR_OFF (0)

/** \\brief  Length for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_LEN (4)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.SUS */
#define IFX_VADC_OCS_SUS_OFF (24)

/** \\brief  Length for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.SUS_P */
#define IFX_VADC_OCS_SUS_P_OFF (28)

/** \\brief  Length for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.SUSSTA */
#define IFX_VADC_OCS_SUSSTA_OFF (29)

/** \\brief  Length for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TG_P */
#define IFX_VADC_OCS_TG_P_OFF (3)

/** \\brief  Length for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_LEN (1)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TGB */
#define IFX_VADC_OCS_TGB_OFF (2)

/** \\brief  Length for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_LEN (2)

/** \\brief  Mask for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_OCS_Bits.TGS */
#define IFX_VADC_OCS_TGS_OFF (0)

