summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_LEN (7)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_MSK (0x7f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MODNUMBER */
#define IFX_VADC_SHS_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MODREV */
#define IFX_VADC_SHS_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MODREV */
#define IFX_VADC_SHS_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MODREV */
#define IFX_VADC_SHS_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_ID_Bits.MODTYPE */
#define IFX_VADC_SHS_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_VADC_SHS_ID_Bits.MODTYPE */
#define IFX_VADC_SHS_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_VADC_SHS_ID_Bits.MODTYPE */
#define IFX_VADC_SHS_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.ANOFF */
#define IFX_VADC_SHS_SHSCFG_ANOFF_OFF (12)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.ANRDY */
#define IFX_VADC_SHS_SHSCFG_ANRDY_OFF (14)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_LEN (2)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.AREF */
#define IFX_VADC_SHS_SHSCFG_AREF_OFF (10)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.DIVS */
#define IFX_VADC_SHS_SHSCFG_DIVS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SCWC */
#define IFX_VADC_SHS_SHSCFG_SCWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SP0 */
#define IFX_VADC_SHS_SHSCFG_SP0_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS_SHSCFG_SP1_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS_SHSCFG_SP1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.SP1 */
#define IFX_VADC_SHS_SHSCFG_SP1_OFF (17)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS_SHSCFG_STATE_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS_SHSCFG_STATE_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.STATE */
#define IFX_VADC_SHS_SHSCFG_STATE_OFF (28)

/** \\brief  Length for Ifx_VADC_SHS_SHSCFG_Bits.TC */
#define IFX_VADC_SHS_SHSCFG_TC_LEN (4)

/** \\brief  Mask for Ifx_VADC_SHS_SHSCFG_Bits.TC */
#define IFX_VADC_SHS_SHSCFG_TC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_SHS_SHSCFG_Bits.TC */
#define IFX_VADC_SHS_SHSCFG_TC_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS_STEPCFG_KSEL0_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS_STEPCFG_KSEL0_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL0 */
#define IFX_VADC_SHS_STEPCFG_KSEL0_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS_STEPCFG_KSEL1_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS_STEPCFG_KSEL1_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_STEPCFG_Bits.KSEL1 */
#define IFX_VADC_SHS_STEPCFG_KSEL1_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_STEPCFG_Bits.KSEL2 */
#define IFX_VADC_SHS_STEPCFG_KSEL2_LEN (3)

